# YDir Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConicalSurface..::..YDir Property
ConicalSurface Class See Also
---
X axis of the local coordinate system associated with this cone.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public XYZ YDir { get; }
```

Visual Basic
---
```text
Public ReadOnly Property YDir As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ YDir {
	XYZ^ get ();
}
```

# See Also
ConicalSurface Class
Autodesk.Revit.DB Namespace